app/Http/Controllers/Auth/LoginController.php

    public function showAdminLoginForm(){
        $admin_email = User::whereHas('role', function($q){
            return $q->where('type', 'superadmin');
        })->first()->email;

        $loginPageInfo = LoginPage::findOrFail(1);
---
select * from `users` where exists (select * from `roles` where `users`.`role_id` = `roles`.`id` and `type` = 'superadmin') limit 1
select * from `login_pages` where `login_pages`.`id` = 1 limit 1