Modules/Refund/Repositories/RefundRepository.php

    public function getRequestAll()
    {
        return RefundRequest::with('refund_details', 'refund_details.refund_products', 'order')->latest()->get();
---
select * from `orders` where `orders`.`id` in (17)
select * from `refund_requests` order by `created_at` desc

    public function getRequestSeller()
    {
        $seller_id =  getParentSellerId();
        return RefundRequestDetail::with('refund_request', 'seller', 'refund_products', 'order_package')->where('seller_id', $seller_id)->latest()->get();
---
select * from `refund_products` where `refund_products`.`refund_request_detail_id` in (23)
select * from `refund_request_details` where `seller_id` = 33 order by `created_at` desc