app/Models/Cart.php

    public function scopeTotalCart($query, $type)
    {
        $year = Carbon::now()->year;
        if ($type == "today") {
            return $query->whereBetween('created_at', [Carbon::now()->format('y-m-d')." 00:00:00", Carbon::now()->format('y-m-d')." 23:59:59"])->get()->count();
---
select * from `carts` where `created_at` between '26-02-07 00:00:00' and '26-02-07 23:59:59'