app/Models/OrderPackageDetail.php

    public function scopeTotalOrders($query,$type)
    {
        $seller_id = getParentSellerId();
        $year = Carbon::now()->year;
        if ($type == "today") {
            $query->whereBetween('created_at', [Carbon::now()->format('y-m-d')." 00:00:00", Carbon::now()->format('y-m-d')." 23:59:59"]);
        }
        if ($type == "week") {
            $query->whereBetween('created_at', [Carbon::now()->subDays(7)->format('y-m-d')." 00:00:00", Carbon::now()->format('y-m-d')." 23:59:59"]);
        }
        if ($type == "month") {
            $month = Carbon::now()->month;
            $date_1 = Carbon::create($year, $month)->startOfMonth()->format('Y-m-d')." 00:00:00";
            $query->whereBetween('created_at', [$date_1, Carbon::now()->format('y-m-d')." 23:59:59"]);
        }
        if ($type == "year") {
            $date_1 = Carbon::create($year, 1)->startOfMonth()->format('Y-m-d')." 00:00:00";
            $query->whereBetween('created_at', [$date_1, Carbon::now()->format('y-m-d')." 23:59:59"]);
        }
        return $query->with('order', 'seller', 'order.customer')->where('seller_id',$seller_id)->get()->count();
---
select * from `order_package_details` where `created_at` between '26-02-07 00:00:00' and '26-02-07 23:59:59' and `seller_id` = 33
select * from `orders` where `orders`.`id` in (32)

    public function scopeTotalDeliveredOrders($query,$type,$state)
    {
        $seller_id = getParentSellerId();
        $year = Carbon::now()->year;
        if ($type == "today") {
            $query->whereBetween('updated_at', [Carbon::now()->format('y-m-d')." 00:00:00", Carbon::now()->format('y-m-d')." 23:59:59"]);
        }
        if ($type == "week") {
            $query->whereBetween('updated_at', [Carbon::now()->subDays(7)->format('y-m-d')." 00:00:00", Carbon::now()->format('y-m-d')." 23:59:59"]);
        }
        if ($type == "month") {
            $month = Carbon::now()->month;
            $date_1 = Carbon::create($year, $month)->startOfMonth()->format('Y-m-d')." 00:00:00";
            $query->whereBetween('updated_at', [$date_1, Carbon::now()->format('y-m-d')." 23:59:59"]);
        }
        if ($type == "year") {
            $date_1 = Carbon::create($year, 1)->startOfMonth()->format('Y-m-d')." 00:00:00";
            $query->whereBetween('updated_at', [$date_1, Carbon::now()->format('y-m-d')." 23:59:59"]);
        }
        if ($state == "delivered") {
            return $query->with('order', 'seller', 'order.customer')->where('seller_id',$seller_id)->where('delivery_status','>=',5)->get()->count();
---
select * from `order_package_details` where `updated_at` between '26-02-07 00:00:00' and '26-02-07 23:59:59' and `seller_id` = 33 and `delivery_status` < 5
select * from `orders` where `orders`.`id` in (21, 22, 27, 28, 29, 31, 32)

    public function scopeLatestOrder($query)
    {
        $seller_id = getParentSellerId();
        return $query->with('order', 'seller', 'order.customer')->where('seller_id',$seller_id)->latest()->take(10)->get();
---
select * from `order_package_details` where `seller_id` = 33 order by `created_at` desc limit 10

    public function scopeNetTotalProductSaleAmount($query, $type)
    {
        $seller_id = getParentSellerId();
        $year = Carbon::now()->year;
        if ($type == "today") {
            $query->whereBetween('created_at', [Carbon::now()->format('y-m-d')." 00:00:00", Carbon::now()->format('y-m-d')." 23:59:59"]);
        }
        if ($type == "week") {
            $query->whereBetween('created_at', [Carbon::now()->subDays(7)->format('y-m-d')." 00:00:00", Carbon::now()->format('y-m-d')." 23:59:59"]);
        }
        if ($type == "month") {
            $month = Carbon::now()->month;
            $date_1 = Carbon::create($year, $month)->startOfMonth()->format('Y-m-d')." 00:00:00";
            $query->whereBetween('created_at', [$date_1, Carbon::now()->format('y-m-d')." 23:59:59"]);
        }
        if ($type == "year") {
            $date_1 = Carbon::create($year, 1)->startOfMonth()->format('Y-m-d')." 00:00:00";
            $query->whereBetween('created_at', [$date_1, Carbon::now()->format('y-m-d')." 23:59:59"]);
        }
        $orderPackageIds = $query->where('seller_id',$seller_id)->pluck('id');
        return OrderProductDetail::whereIn('package_id', $orderPackageIds)->sum('total_price');
---
select sum(`total_price`) as aggregate from `order_product_details` where `package_id` in (32)