Modules/FrontendCMS/Entities/HomePageSection.php

select * from `products` where `products`.`id` in (23, 24, 25, 28, 29, 36, 37, 38, 41, 42, 44)
---
    public function getProductByQuery()
    {
        $filterRepo = new FilterRepository();
        $data = $filterRepo->getSectionProducts($this->section_name);
        return $data['products']->with('skus', 'product.gallary_images')->take(12)->get();